import json
import struct
import volatility.plugins.vadinfo as vadinfo
import volatility.plugins.taskmods as taskmods
import volatility.plugins.handles as handles
import volatility.obj as obj
import volatility.utils as utils
import volatility.debug as debug
import volatility.constants as constants
import volatility.plugins.filescan as filescan
from volatility.plugins.common import AbstractWindowsCommand
import volatility.win32.tasks as vtasks


class Win10userspace(AbstractWindowsCommand):
    """Traversing the accessible memory areas in the user address space"""

    def __init__(self, config, *args, **kwargs):

        AbstractWindowsCommand.__init__(self, config, *args,**kwargs)

        self._config.add_option('PID', short_option = 'p', default = None,
                      help = 'Operate on these Process IDs (comma-separated)',
                      action = 'store', type = 'str')
        self.addr_space = utils.load_as(self._config)

        #Import the segment heap data structure
        if self._config.profile == 'Win10x64_17763':
            self.addr_space.profile.add_types({
                '_SEGMENT_HEAP': [0x7c0, {
                    'EnvHandle': [0x0, ['RTL_HP_ENV_HANDLE']],
                    'Signature': [0x10, ['unsigned long']],
                    'GlobalFlags': [0x14, ['unsigned long']],
                    'Interceptor': [0x18, ['unsigned long']],
                    'ProcessHeapListIndex': [0x1c, ['unsigned short']],
                    'AllocatedFromMetadata': [0x1e,
                                              ['BitField', dict(start_bit=0, end_bit=1, native_type='unsigned short')]],
                    'CommitLimitData': [0x20, ['_RTL_HEAP_MEMORY_LIMIT_DATA']],
                    'LargeMetadataLock': [0x40, ['unsigned long long']],
                    'LargeAllocMetadata': [0x48, ['_RTL_RB_TREE']],
                    'LargeReservedPages': [0x58, ['unsigned long long']],
                    'LargeCommittedPages': [0x60, ['unsigned long long']],
                    'StackTraceInitVar': [0x68, ['_RTL_RUN_ONCE']],
                    'MemStats': [0x80, ['_HEAP_RUNTIME_MEMORY_STATS']],
                    'GlobalLockCount': [0xd8, ['unsigned short']],
                    'GlobalLockOwner': [0xdc, ['unsigned long']],
                    'ContextExtendLock': [0xe0, ['unsigned long long']],
                    'AllocatedBase': [0xe8, ['pointer64', ['unsigned char']]],
                    'UncommittedBase': [0xf0, ['pointer64', ['unsigned char']]],
                    'ReservedLimit': [0xf8, ['pointer64', ['unsigned char']]],
                    'SegContexts': [0x100, ['array', 2, ['_HEAP_SEG_CONTEXT']]],
                    'VsContext': [0x280, ['_HEAP_VS_CONTEXT']],
                    'LfhContext': [0x300, ['_HEAP_LFH_CONTEXT']],
                }],
                '_HEAP_SEG_CONTEXT': [0xc0, {
                    'SegmentMask': [0x0, ['unsigned long long']],
                    'UnitShift': [0x8, ['unsigned char']],
                    'PagesPerUnitShift': [0x9, ['unsigned char']],
                    'FirstDescriptorIndex': [0xa, ['unsigned char']],
                    'CachedCommitSoftShift': [0xb, ['unsigned char']],
                    'CachedCommitHighShift': [0xc, ['unsigned char']],
                    'Flags': [0xd, ['__unnamed_1833']],
                    'MaxAllocationSize': [0x10, ['unsigned long']],
                    'OlpStatsOffset': [0x14, ['short']],
                    'MemStatsOffset': [0x16, ['short']],
                    'LfhContext': [0x18, ['pointer64', ['void']]],
                    'VsContext': [0x20, ['pointer64', ['void']]],
                    'EnvHandle': [0x28, ['RTL_HP_ENV_HANDLE']],
                    'Heap': [0x38, ['pointer64', ['void']]],
                    'SegmentLock': [0x40, ['unsigned long long']],
                    'SegmentListHead': [0x48, ['_LIST_ENTRY']],
                    'SegmentCount': [0x58, ['unsigned long long']],
                    'FreePageRanges': [0x60, ['_RTL_RB_TREE']],
                    'FreeSegmentListLock': [0x70, ['unsigned long long']],
                    'FreeSegmentList': [0x78, ['array', 2, ['_SINGLE_LIST_ENTRY']]],
                }],
                '_HEAP_LARGE_ALLOC_DATA': [0x28, {
                    'TreeNode': [0x0, ['_RTL_BALANCED_NODE']],
                    'VirtualAddress': [0x18, ['unsigned long long']],
                    'UnusedBytes': [0x18,
                                    ['BitField', dict(start_bit=0, end_bit=16, native_type='unsigned long long')]],
                    'ExtraPresent': [0x20,
                                     ['BitField', dict(start_bit=0, end_bit=1, native_type='unsigned long long')]],
                    'GuardPageCount': [0x20,
                                       ['BitField', dict(start_bit=1, end_bit=2, native_type='unsigned long long')]],
                    'GuardPageAlignment': [0x20, ['BitField',
                                                  dict(start_bit=2, end_bit=8, native_type='unsigned long long')]],
                    'Spare': [0x20, ['BitField', dict(start_bit=8, end_bit=12, native_type='unsigned long long')]],
                    'AllocatedPages': [0x20,
                                       ['BitField', dict(start_bit=12, end_bit=64, native_type='unsigned long long')]],
                }]
            })

        if self._config.profile == 'Win10x64_17134':
            self.addr_space.profile.add_types({
                '_SEGMENT_HEAP': [0x6f0, {
                    'EnvHandle': [0x0, ['RTL_HP_ENV_HANDLE']],
                    'Signature': [0x10, ['unsigned long']],
                    'GlobalFlags': [0x14, ['unsigned long']],
                    'MemStats': [0x18, ['_HEAP_RUNTIME_MEMORY_STATS']],
                    'Interceptor': [0x38, ['unsigned long']],
                    'ProcessHeapListIndex': [0x3c, ['unsigned short']],
                    'GlobalLockCount': [0x3e, ['unsigned short']],
                    'GlobalLockOwner': [0x40, ['unsigned long']],
                    'AllocatedFromMetadata': [0x44,
                                              ['BitField', dict(start_bit=0, end_bit=1, native_type='unsigned long')]],
                    'LargeMetadataLock': [0x48, ['unsigned long long']],
                    'LargeAllocMetadata': [0x50, ['_RTL_RB_TREE']],
                    'LargeReservedPages': [0x60, ['unsigned long long']],
                    'LargeCommittedPages': [0x68, ['unsigned long long']],
                    'SegContexts': [0x70, ['array', 2, ['_HEAP_SEG_CONTEXT']]],
                    'StackTraceInitVar': [0x160, ['_RTL_RUN_ONCE']],
                    'ContextExtendLock': [0x168, ['unsigned long long']],
                    'AllocatedBase': [0x170, ['pointer64', ['unsigned char']]],
                    'UncommittedBase': [0x178, ['pointer64', ['unsigned char']]],
                    'ReservedLimit': [0x180, ['pointer64', ['unsigned char']]],
                    'VsContext': [0x188, ['_HEAP_VS_CONTEXT']],
                    'LfhContext': [0x200, ['_HEAP_LFH_CONTEXT']],
                }],
                '_HEAP_SEG_CONTEXT': [0x78, {
                    'SegmentMask': [0x0, ['unsigned long long']],
                    'UnitShift': [0x8, ['unsigned char']],
                    'PagesPerUnitShift': [0x9, ['unsigned char']],
                    'FirstDescriptorIndex': [0xa, ['unsigned char']],
                    'CachedCommitSoftShift': [0xb, ['unsigned char']],
                    'CachedCommitHighShift': [0xc, ['unsigned char']],
                    'Flags': [0xd, ['__unnamed_180f']],
                    'MaxAllocationSize': [0x10, ['unsigned long']],
                    'SegmentLock': [0x18, ['unsigned long long']],
                    'SegmentListHead': [0x20, ['_LIST_ENTRY']],
                    'SegmentCount': [0x30, ['unsigned long long']],
                    'FreePageRanges': [0x38, ['_RTL_RB_TREE']],
                    'MemStats': [0x48, ['pointer64', ['_HEAP_RUNTIME_MEMORY_STATS']]],
                    'LfhContext': [0x50, ['pointer64', ['void']]],
                    'VsContext': [0x58, ['pointer64', ['void']]],
                    'EnvHandle': [0x60, ['RTL_HP_ENV_HANDLE']],
                    'Heap': [0x70, ['pointer64', ['void']]],
                }],
                '_HEAP_LARGE_ALLOC_DATA': [0x28, {
                    'TreeNode': [0x0, ['_RTL_BALANCED_NODE']],
                    'VirtualAddress': [0x18, ['unsigned long long']],
                    'UnusedBytes': [0x18,
                                    ['BitField', dict(start_bit=0, end_bit=16, native_type='unsigned long long')]],
                    'ExtraPresent': [0x20,
                                     ['BitField', dict(start_bit=0, end_bit=1, native_type='unsigned long long')]],
                    'GuardPageCount': [0x20,
                                       ['BitField', dict(start_bit=1, end_bit=2, native_type='unsigned long long')]],
                    'GuardPageAlignment': [0x20, ['BitField',
                                                  dict(start_bit=2, end_bit=8, native_type='unsigned long long')]],
                    'Spare': [0x20, ['BitField', dict(start_bit=8, end_bit=12, native_type='unsigned long long')]],
                    'AllocatedPages': [0x20,
                                       ['BitField', dict(start_bit=12, end_bit=64, native_type='unsigned long long')]],
                }]
            })
        if self._config.profile == 'Win10x64_16299':
            self.addr_space.profile.add_types({
                '_SEGMENT_HEAP': [0x6c0, {
                    'Padding': [0x0, ['array', 2, ['pointer64', ['void']]]],
                    'Signature': [0x10, ['unsigned long']],
                    'GlobalFlags': [0x14, ['unsigned long']],
                    'MemStats': [0x18, ['_HEAP_RUNTIME_MEMORY_STATS']],
                    'Interceptor': [0x38, ['unsigned long']],
                    'ProcessHeapListIndex': [0x3c, ['unsigned short']],
                    'GlobalLockCount': [0x3e, ['unsigned short']],
                    'GlobalLockOwner': [0x40, ['unsigned long']],
                    'LargeMetadataLock': [0x48, ['_RTL_SRWLOCK']],
                    'LargeAllocMetadata': [0x50, ['_RTL_RB_TREE']],
                    'LargeReservedPages': [0x60, ['unsigned long long']],
                    'LargeCommittedPages': [0x68, ['unsigned long long']],
                    'SegContexts': [0x70, ['array', 2, ['_HEAP_SEG_CONTEXT']]],
                    'StackTraceInitVar': [0x140, ['_RTL_RUN_ONCE']],
                    'ContextExtendLock': [0x148, ['_RTL_SRWLOCK']],
                    'AllocatedBase': [0x150, ['pointer64', ['unsigned char']]],
                    'UncommittedBase': [0x158, ['pointer64', ['unsigned char']]],
                    'ReservedLimit': [0x160, ['pointer64', ['unsigned char']]],
                    'VsContext': [0x168, ['_HEAP_VS_CONTEXT']],
                    'LfhContext': [0x1e0, ['_HEAP_LFH_CONTEXT']],
                }],
                '_HEAP_SEG_CONTEXT': [0x68, {
                    'SegmentMask': [0x0, ['unsigned long long']],
                    'UnitShift': [0x8, ['unsigned char']],
                    'PagesPerUnitShift': [0x9, ['unsigned char']],
                    'FirstDescriptorIndex': [0xa, ['unsigned char']],
                    'CachedCommitSoftShift': [0xb, ['unsigned char']],
                    'CachedCommitHighShift': [0xc, ['unsigned char']],
                    'MaxAllocationSize': [0x10, ['unsigned long']],
                    'SegmentLock': [0x18, ['_RTL_SRWLOCK']],
                    'SegmentListHead': [0x20, ['_LIST_ENTRY']],
                    'SegmentCount': [0x30, ['unsigned long long']],
                    'FreePageRanges': [0x38, ['_RTL_RB_TREE']],
                    'MemStats': [0x48, ['pointer64', ['_HEAP_RUNTIME_MEMORY_STATS']]],
                    'LfhContext': [0x50, ['pointer64', ['void']]],
                    'VsContext': [0x58, ['pointer64', ['void']]],
                    'Heap': [0x60, ['pointer64', ['void']]],
                }],
                '_HEAP_LARGE_ALLOC_DATA': [0x28, {
                    'TreeNode': [0x0, ['_RTL_BALANCED_NODE']],
                    'VirtualAddress': [0x18, ['unsigned long long']],
                    'UnusedBytes': [0x18,
                                    ['BitField', dict(start_bit=0, end_bit=16, native_type='unsigned long long')]],
                    'ExtraPresent': [0x20,
                                     ['BitField', dict(start_bit=0, end_bit=1, native_type='unsigned long long')]],
                    'Spare': [0x20, ['BitField', dict(start_bit=1, end_bit=12, native_type='unsigned long long')]],
                    'AllocatedPages': [0x20,
                                       ['BitField', dict(start_bit=12, end_bit=64, native_type='unsigned long long')]],
                }]
            })
        if self._config.profile == 'Win10x64_15063' or self._config.profile == 'Win10x64_14393':
            self.addr_space.profile.add_types({
                '_SEGMENT_HEAP': [0x5f0, {
                    'TotalReservedPages': [0x0, ['unsigned long long']],
                    'TotalCommittedPages': [0x8, ['unsigned long long']],
                    'Signature': [0x10, ['unsigned long']],
                    'GlobalFlags': [0x14, ['unsigned long']],
                    'FreeCommittedPages': [0x18, ['unsigned long long']],
                    'Interceptor': [0x20, ['unsigned long']],
                    'ProcessHeapListIndex': [0x24, ['unsigned short']],
                    'GlobalLockCount': [0x26, ['unsigned short']],
                    'GlobalLockOwner': [0x28, ['unsigned long']],
                    'LargeMetadataLock': [0x30, ['_RTL_SRWLOCK']],
                    'LargeAllocMetadata': [0x38, ['_RTL_RB_TREE']],
                    'LargeReservedPages': [0x48, ['unsigned long long']],
                    'LargeCommittedPages': [0x50, ['unsigned long long']],
                    'SegmentAllocatorLock': [0x58, ['_RTL_SRWLOCK']],
                    'SegmentListHead': [0x60, ['_LIST_ENTRY']],
                    'SegmentCount': [0x70, ['unsigned long long']],
                    'FreePageRanges': [0x78, ['_RTL_RB_TREE']],
                    'StackTraceInitVar': [0x88, ['_RTL_RUN_ONCE']],
                    'ContextExtendLock': [0x90, ['_RTL_SRWLOCK']],
                    'AllocatedBase': [0x98, ['pointer64', ['unsigned char']]],
                    'UncommittedBase': [0xa0, ['pointer64', ['unsigned char']]],
                    'ReservedLimit': [0xa8, ['pointer64', ['unsigned char']]],
                    'VsContext': [0xb0, ['_HEAP_VS_CONTEXT']],
                    'LfhContext': [0x120, ['_HEAP_LFH_CONTEXT']],
                }],
                '_HEAP_LARGE_ALLOC_DATA': [0x28, {
                    'TreeNode': [0x0, ['_RTL_BALANCED_NODE']],
                    'VirtualAddress': [0x18, ['unsigned long long']],
                    'UnusedBytes': [0x18,
                                    ['BitField', dict(start_bit=0, end_bit=16, native_type='unsigned long long')]],
                    'ExtraPresent': [0x20,
                                     ['BitField', dict(start_bit=0, end_bit=1, native_type='unsigned long long')]],
                    'Spare': [0x20, ['BitField', dict(start_bit=1, end_bit=12, native_type='unsigned long long')]],
                    'AllocatedPages': [0x20,
                                       ['BitField', dict(start_bit=12, end_bit=64, native_type='unsigned long long')]],
                }]
            })

    def filter_tasks(self, tasks):
        '''Filter the process'''
        if self._config.PID is None:
            return tasks

        try:
            pidlist = [int(p) for p in self._config.PID.split(',')]
        except ValueError:
            debug.error("Invalid PID {0}".format(self._config.PID))

        return [t for t in tasks if t.UniqueProcessId in pidlist]


    def calculate(self):
        #check wow64 process
        self.wow64 = False

        self.tasks = list(vtasks.pslist(self.addr_space))
        tasks_list = self.filter_tasks(vtasks.pslist(self.addr_space))

        #get handles for all processes
        self.segments = self.get_section_segments()


        #Check profile
        support_profiles = ['Win10x64_14393', 'Win10x64_15063',
                            'Win10x64_16299', 'Win10x64_17134',
                            'Win10x64_18362', 'Win10x64_17763',
                            'Win10x64_19041']
        profile = self._config.profile
        if not profile in support_profiles:
            debug.warning("Warning - {0} profile not supported".format(self._config.profile))


        #analyze through each process
        for task in tasks_list:
            if task.IsWow64:
                self.wow64 = True
            for data in self.analyze(task):
                yield data



    def analyze(self, task):
        """Analyze the userspace memory and return allocation information"""
        pid = task.UniqueProcessId
        #get the process address space
        ps_ad = task.get_process_address_space()
        user_pages = self.get_user_pages(ps_ad)

        #get the user allocations
        self.user_allocs = {}
        self.unreferenced = []
        self.get_user_allocations(task, user_pages)

        #get the unreferenced KSHARED_USER_DATA
        self.get_kshared()

        #process kernel metadata
        self.get_kernel_metadata()

        #process user space metadata
        self.get_user_metadata(ps_ad, task, pid)

        #sort addresses for output purposes
        addresses = self.user_allocs.keys()
        addresses.sort()

        #return user allocation information
        yield task, self.user_allocs, addresses, self.unreferenced


    def render_text(self, outfd, data):
        """Print the results to the screen"""
        outfd.write("Acquiring Section Handles\n")        
        for task, user_allocs, addresses, unreferenced in data:
            #output process info
            info = "Analysing PID: {0:d} - {1:s}\n"
            pid = task.UniqueProcessId 
            outfd.write(info.format(pid, task.ImageFileName))

            #output user allocation information
            outfd.write("User Allocations\n")
            header = "{0:12} {1:12}  {2:8} {3:8}  {4:17}  {5:13}  {6}\n"
            outfd.write(header.format("Start", "End", "Used", "Size", "Permission", "Type", "Description"))
            outfd.write(("-"*12 + " ") * 2 + " " +("-"*8 + " ") * 2 + " " + "-"*17 + " "*2 + "-"*13 + " "*2 + "-"*29 +
                        "\n")
            line = "{0:012x} {1:012x}  {2:08x} {3:08x}  {4:17s}  {5:14s} {6:s}"
            section = " "*80 + "{0}\n"
            for addr in addresses:
                alloc = user_allocs[addr]
                description = alloc.description()
                if description == "":
                    #output section info on same line
                    description = alloc.section_description
                    section_description = ""
                else:
                    #output section info on a different line
                    section_description = alloc.section_description
                outfd.write(line.format(alloc.start_address,
